In [3]:
import pandas as pd
import numpy as np

**NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column**

**series:** The object supports both integer- and label-based indexing and provides a host of methods for performing operations involving the index.

In [5]:
pd.Series((np.arange(1,12)))

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
dtype: int64

**DataFrame:**Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).

In [6]:
pd.DataFrame(np.arange(12).reshape(3,4))

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [15]:
pd.DataFrame(np.arange(12).reshape(4,3),columns= list('ABC')) #gives ABC as columns name

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [26]:
pd.DataFrame(np.arange(12).reshape(4,3),columns=list('ABC'),index=list('efgh'))# index gives name to the rows.

   A   B   C
e  0   1   2
f  3   4   5
g  6   7   8
h  9  10  11

**date_range**:Return a fixed frequency DatetimeIndex.

In [27]:
pd.date_range("20130101", periods=6) # DatetimeIndex an immutable container for datetimes

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

**pd.stamp:**Pandas replacement for python datetime.datetime object.

**pd.categorical:**oriCategoricals are a pandas data type that corresponds to the categorical variables in statistics. Such variables take on a fixed and limited number of possible values. For examples â€“ grades, gender, blood group type etc.

**foo:** is used as a place-holder name, usually in example code to signify that the object being named, or the choice of name,

In [30]:
df2 = pd.DataFrame(  #df2 is an dataframe obj
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
        "G": pd.Series(np.arange(4))
    }
)
df2

     A          B    C  D      E    F  G
0  1.0 2013-01-02  1.0  3   test  foo  0
1  1.0 2013-01-02  1.0  3  train  foo  1
2  1.0 2013-01-02  1.0  3   test  foo  2
3  1.0 2013-01-02  1.0  3  train  foo  3

In [29]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G             int64
dtype: object

In [31]:
df2.head(2) #Return the first n rows.

     A          B    C  D      E    F  G
0  1.0 2013-01-02  1.0  3   test  foo  0
1  1.0 2013-01-02  1.0  3  train  foo  1

In [32]:
df2.tail(2) # Return the last n rows.

     A          B    C  D      E    F  G
2  1.0 2013-01-02  1.0  3   test  foo  2
3  1.0 2013-01-02  1.0  3  train  foo  3

In [33]:
df2.index #The row labels of the DataFrame.

Int64Index([0, 1, 2, 3], dtype='int64')

In [34]:
df2.columns #The column labels of the DataFrame.

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')

In [ ]:
df2.to_numpy